#language: ru

Функционал: Проверка работы TODO листа

  Сценарий: Создать задачу
    * открыть страницу
    * ввести имя задачи и сохранить задачу
    * проверить наличие созданной задачи

  Сценарий: Отметить задачу выполненной
    * проверить наличие созданной задачи
    * отметить задачу выполненной
    * проверить наличие выполненной задачи

  Сценарий: Удалить выполненную задачу
    * проверить наличие выполненной задачи
    * удалить выполненную задачу
    * проверить, что выполненной задачи нет